src/Catalogs/АлгоритмыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АлгоритмыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеПриНевыполнении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеИменованныеКонстанты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ВозвратыОтПокупателяКэшНаВызов/Ext/Module.bsl
Функция ПолучитьЗначениеИК( пПутьКИК ) Экспорт
	
	ЗначениеИК = Неопределено;
	
	НайденныйЭлемент = Справочники.ИменованныеКонстантыПроцессов.НайтиПоНаименованию(пПутьКИК);	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		ЗначениеИК = НайденныйЭлемент.Значение;
	Иначе
		ВызватьИсключение "Не найдена именованная константа по имени """+пПутьКИК+"""!";
	КонецЕсли;
	
	Возврат ЗначениеИК;
	
КонецФункции	//ИК

Функция ПолучитьЗначениеИКИзАлгоритма( ТекущийАлгоритм, пПутьКИК ) Экспорт
	
	ЗначениеИК = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Значение
		|ИЗ
		|	Справочник.АлгоритмыПроцессов.ЛокальныеИменованныеКонстанты КАК АлгоритмыПроцессовЛокальныеИменованныеКонстанты
		|ГДЕ
		|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Ссылка = &ТекущийАлгоритм
		|	И АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Имя = &пПутьКИК";
	
	Запрос.УстановитьПараметр("пПутьКИК", пПутьКИК);
	Запрос.УстановитьПараметр("ТекущийАлгоритм", ТекущийАлгоритм);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗначениеИК = Выборка.Значение;
	КонецЕсли;
	
	Если ЗначениеИК = Неопределено Тогда
		 ВызватьИсключение "Не найдена локальная именованная константа по имени """+пПутьКИК+""" для алгоритма """+ТекущийАлгоритм+"""!";
	КонецЕсли;
	
	Возврат ЗначениеИК;
	
КонецФункции	//ИК
